
&Перед("ЗагрузитьПроцедурыИФункцииВОбъектыМетаданных")
Процедура КД3_Fix_ЗагрузитьПроцедурыИФункцииВОбъектыМетаданных(ТаблицаРезультатов)
	
	Если НЕ ПКО Тогда
		Возврат;
	КонецЕсли;
	
	// Предварительное заполнение направлений для ПКО, если оно задано в ЗаполнитьПравилаКонвертацииОбъектов
	СтрокаРезультат = ТаблицаРезультатов.Найти("ЗаполнитьПравилаКонвертацииОбъектов", "ИмяПроцедурыФункции");
	Если ЗначениеЗаполнено(СтрокаРезультат) Тогда
		КД3_Fix_ЗаполнитьНаправлениеПКО(СтрокаРезультат, ТаблицаРезультатов);
	КонецЕсли;
	
КонецПроцедуры

Процедура КД3_Fix_ЗаполнитьНаправлениеПКО(СтрокаРезультат, ТаблицаРезультатов)
	
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	НаправлениеОбмена = Неопределено;
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, "Если НаправлениеОбмена = ""Отправка"" Тогда") <> 0 Тогда
			НаправлениеОбмена = "Отправка";
			
		ИначеЕсли СтрНайти(ТекСтрока, "Если НаправлениеОбмена = ""Получение"" Тогда") <> 0 Тогда
			НаправлениеОбмена = "Получение";
			
		ИначеЕсли СтрНайти(ТекСтрока, "КонецЕсли;") <> 0 Тогда
			НаправлениеОбмена = Неопределено;
			
		ИначеЕсли НаправлениеОбмена <> Неопределено Тогда
			
			НачПроцедуры = СтрНайти(ТекСтрока, "ДобавитьПКО_");
			Если НачПроцедуры <> 0 Тогда
				КонПроцедуры = СтрНайти(ТекСтрока, "(", , НачПроцедуры);
				ИмяПроцедуры = Сред(ТекСтрока, НачПроцедуры, КонПроцедуры - НачПроцедуры);
				СтрокаРезультатаПКО = ТаблицаРезультатов.Найти(ИмяПроцедуры, "ИмяПроцедурыФункции");
				Если ЗначениеЗаполнено(СтрокаРезультатаПКО) Тогда
					СтрокаРезультатаПКО[НаправлениеОбмена] = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
